Repository: EKT1/valence_server
Catalog: valence_server/i18n/*/LC_MESSAGES/messages.po
Languages: et

source: mostly mixed
et: vastuoluline

source: only neutral
et: neutraalne

source: only positive
et: positiivne

source: only negative
et: negatiivne

source: mostly neutral
et: enamjaolt neutraalne

source: mostly positive
et: enamjaolt positiivne

source: mostly negative
et: enamjaolt negatiivne

source: positive =
et: positiivne =

source: negative =
et: negatiivne =

source: neutral =
et: neutraalne =

source: words:
et: sõnu:

source: Probability
et: Tõenäosus

source: positive:
et: positiivseid:

source: negative:
et: negatiivseid:

source: extreme:
et: ekstreemseid

source: Valence
et: Hinnang

source: Article
et: Artikkel

source: Articles
et: Artiklid

source: Paragraphs are
et: Lõikude mõju hinnang on

source: positive
et: positiivne

source: negative
et: negatiivne

source: neutral2
et: neutraalne

source: or
et: või

source: ambivalent
et: vastuoluline

source: Keywords are
et: Võtmesõna hinnang on

source: extreme
et: ekstreemne

source: The lexicon based rating of the valence is on the left side
et: Vasakul on lõigu leksikonipõhine hinnang

source: Back
et: Tagasi

source: Emotion detector
et: Emotsioonidetektor

source: Category
et: Rubriik

source: all
et: kõik

source: Emotion
et: Emotsioon

source: Show
et: Näita

source: List all articles
et: Näita kõiki artikleid

source: Export all as CSV
et: Lae alla korpus (CSV)

source: Query
et: Valik

source: Paragraphs
et: Lõigud

source: The emotion detector predicts what the text effect on the reader will be
et: Emotsioonidetektor ennustab, milline on teksti mõju lugejale

source: Paste your text here
et: Kopeeri tekst siia

source: The text must be divided into paragraphs.
et: Tekst peab olema liigendatud lõikudeks.

source: A paragraph is formed of at least two substantially related sentences.
et: Lõigu moodustavad vähemalt kaks sisuliselt seotud lauset.

source: NB! The detector does not assign the effect of solitary words.
et: NB! Detektor ei määra üksiksõnade mõju.

source: Use lexicon based estimate
et: Kasuta leksikonipõhist hinnangut

source: The Emotion Detector has been created at the Institute of the Estonian Language under the project "Statistical Models of the Emotionality of Speech and Written Text" that was financed by the National Programm for Estonian Language Technology 2011-2017. The Emotion Detector allows to identify the positivity, negativity and neutrality in paragraphs of written text
et: Emotsioonidetektor on Eesti Keele Instituudis riikliku programmi "Eesti keeletehnoloogia 2011-2017" projekti "Kõne ja teksti emotsionaalsuse statistilised mudelid" raames loodud vahend kirjaliku teksti ortograafiliste lõikude positiivsuse, negatiivsuse ja neutraalsuse tuvastamiseks

source: Cite
et: Viide
